socialNetwork/wrk2/test-run/COMMAND_11/33
Running 1m test @ http://localhost:31111/wrk2-api/home-timeline/read
  8 threads and 16 connections
  Thread calibration: mean lat.: 0.885ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.888ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.813ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.862ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.896ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.934ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.857ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.838ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     0.86ms  265.62us   1.65ms   86.38%
    Req/Sec   131.63     92.04   222.00     71.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  816.00us
 75.000%    0.94ms
 90.000%    1.11ms
 99.000%    1.65ms
 99.900%    2.98ms
 99.990%    9.38ms
 99.999%   17.85ms
100.000%   17.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.358     0.000000            2         1.00
       0.650     0.100000         5043         1.11
       0.700     0.200000        10015         1.25
       0.740     0.300000        15004         1.43
       0.777     0.400000        20034         1.67
       0.816     0.500000        25107         2.00
       0.836     0.550000        27578         2.22
       0.859     0.600000        30082         2.50
       0.884     0.650000        32572         2.86
       0.912     0.700000        35064         3.33
       0.945     0.750000        37521         4.00
       0.963     0.775000        38799         4.44
       0.984     0.800000        40058         5.00
       1.008     0.825000        41276         5.71
       1.036     0.850000        42527         6.67
       1.069     0.875000        43781         8.00
       1.089     0.887500        44406         8.89
       1.112     0.900000        45000        10.00
       1.146     0.912500        45637        11.43
       1.174     0.925000        46270        13.33
       1.205     0.937500        46878        16.00
       1.224     0.943750        47193        17.78
       1.247     0.950000        47500        20.00
       1.274     0.956250        47810        22.86
       1.306     0.962500        48125        26.67
       1.349     0.968750        48443        32.00
       1.373     0.971875        48600        35.56
       1.400     0.975000        48748        40.00
       1.435     0.978125        48906        45.71
       1.478     0.981250        49059        53.33
       1.531     0.984375        49216        64.00
       1.560     0.985938        49294        71.11
       1.588     0.987500        49372        80.00
       1.625     0.989062        49450        91.43
       1.679     0.990625        49528       106.67
       1.737     0.992188        49607       128.00
       1.763     0.992969        49647       142.22
       1.802     0.993750        49684       160.00
       1.841     0.994531        49723       182.86
       1.908     0.995313        49762       213.33
       1.984     0.996094        49801       256.00
       2.032     0.996484        49821       284.44
       2.059     0.996875        49840       320.00
       2.125     0.997266        49860       365.71
       2.213     0.997656        49880       426.67
       2.343     0.998047        49899       512.00
       2.419     0.998242        49909       568.89
       2.549     0.998437        49918       640.00
       2.635     0.998633        49928       731.43
       2.819     0.998828        49938       853.33
       3.023     0.999023        49948      1024.00
       3.137     0.999121        49953      1137.78
       3.339     0.999219        49957      1280.00
       3.469     0.999316        49962      1462.86
       3.693     0.999414        49967      1706.67
       3.923     0.999512        49972      2048.00
       4.323     0.999561        49975      2275.56
       4.435     0.999609        49977      2560.00
       4.747     0.999658        49979      2925.71
       5.103     0.999707        49982      3413.33
       5.303     0.999756        49984      4096.00
       5.499     0.999780        49986      4551.11
       5.531     0.999805        49987      5120.00
       5.955     0.999829        49988      5851.43
       6.067     0.999854        49989      6826.67
       6.399     0.999878        49990      8192.00
       9.375     0.999890        49991      9102.22
       9.615     0.999902        49992     10240.00
       9.615     0.999915        49992     11702.86
      10.079     0.999927        49993     13653.33
      10.079     0.999939        49993     16384.00
      10.351     0.999945        49994     18204.44
      10.351     0.999951        49994     20480.00
      10.351     0.999957        49994     23405.71
      11.095     0.999963        49995     27306.67
      11.095     0.999969        49995     32768.00
      11.095     0.999973        49995     36408.89
      11.095     0.999976        49995     40960.00
      11.095     0.999979        49995     46811.43
      17.855     0.999982        49996     54613.33
      17.855     1.000000        49996          inf
#[Mean    =        0.862, StdDeviation   =        0.266]
#[Max     =       17.840, Total count    =        49996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59992 requests in 1.00m, 11.39MB read
Requests/sec:    999.83
Transfer/sec:    194.30KB